# -*- coding: utf-8 -*-
"""Work№2.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1uIhFJDzzmXu1Kx0zhtEmzrjddRixK2a3

Вариант №3 (15,9).

Составить список учебной группы, включающий Х человек. Для каждого студента указать: фамилию и имя, дату рождения (год, месяц и число), также у каждого студента есть зачетка, в которой указаны: предмет (от трех до пяти), дата экзамена, ФИО преподавателя.
Программа должна обладать следующим функционалом:

Задание №9. Вывод в виде таблицы ФИО и даты рождения всех студентов, отсортированных по дате рождения
"""

import pandas as pd
from datetime import datetime

# Список студентов
students = [
    {"Номер": 1, "Фамилия": "Асатрян", "Имя": "Давид", "Дата рождения": datetime(2000, 5, 10)},
    {"Номер": 2, "Фамилия": "Васильев", "Имя": "Григорий", "Дата рождения": datetime(2001, 8, 15)},
    {"Номер": 3, "Фамилия": "Рублев", "Имя": "Владимир", "Дата рождения": datetime(1999, 3, 20)},
    {"Номер": 4, "Фамилия": "Курченко", "Имя": "Иван", "Дата рождения": datetime(2002, 11, 25)},
    {"Номер": 5, "Фамилия": "Петров", "Имя": "Александр", "Дата рождения": datetime(2000, 7, 5)},
    {"Номер": 6, "Фамилия": "Сидоров", "Имя": "Павел", "Дата рождения": datetime(2001, 4, 18)},
    {"Номер": 7, "Фамилия": "Иванов", "Имя": "Сергей", "Дата рождения": datetime(2002, 9, 30)},
    {"Номер": 8, "Фамилия": "Козлов", "Имя": "Михаил", "Дата рождения": datetime(1998, 12, 12)}
]

# Создание DataFrame из списка студентов
students_df = pd.DataFrame(students)

# Сортировка студентов по дате рождения
students_sorted = students_df.sort_values(by="Дата рождения")

# Вывод таблицы с ФИО и датой рождения студентов, отсортированных по дате рождения
print(students_sorted[["Фамилия", "Имя", "Дата рождения"]])

"""
Вывод компилятора:
   Фамилия        Имя Дата рождения
7    Козлов     Михаил    1998-12-12
2    Рублев   Владимир    1999-03-20
0   Асатрян      Давид    2000-05-10
4    Петров  Александр    2000-07-05
5   Сидоров      Павел    2001-04-18
1  Васильев   Григорий    2001-08-15
6    Иванов     Сергей    2002-09-30
3  Курченко       Иван    2002-11-25
"""

"""Задание №3. Вывод в виде таблицы предмета и оценки определенного студента"""

import pandas as pd
from datetime import datetime
import random  # Для генерации случайных оценок

# Список студентов
students = [
    {"Номер": 1, "Фамилия": "Асатрян", "Имя": "Давид", "Дата рождения": datetime(2000, 5, 10)},
    {"Номер": 2, "Фамилия": "Васильев", "Имя": "Григорий", "Дата рождения": datetime(2001, 8, 15)},
    {"Номер": 3, "Фамилия": "Рублев", "Имя": "Владимир", "Дата рождения": datetime(1999, 3, 20)},
    {"Номер": 4, "Фамилия": "Курченко", "Имя": "Иван", "Дата рождения": datetime(2002, 11, 25)},
    {"Номер": 5, "Фамилия": "Петров", "Имя": "Александр", "Дата рождения": datetime(2000, 7, 5)},
    {"Номер": 6, "Фамилия": "Сидоров", "Имя": "Павел", "Дата рождения": datetime(2001, 4, 18)},
    {"Номер": 7, "Фамилия": "Иванов", "Имя": "Сергей", "Дата рождения": datetime(2002, 9, 30)},
    {"Номер": 8, "Фамилия": "Козлов", "Имя": "Михаил", "Дата рождения": datetime(1998, 12, 12)}
]

# Зачетные книжки студентов (без оценок)
grades = {
    1: {"Математика": {"Дата экзамена": datetime(2023, 12, 15), "Преподаватель": "Иванова"},
        "Физика": {"Дата экзамена": datetime(2023, 12, 20), "Преподаватель": "Петрова"},
        "Химия": {"Дата экзамена": datetime(2024, 1, 10), "Преподаватель": "Сидорова"}},
    2: {"История": {"Дата экзамена": datetime(2023, 11, 25), "Преподаватель": "Козлова"},
        "Литература": {"Дата экзамена": datetime(2023, 12, 5), "Преподаватель": "Смирнова"},
        "Физика": {"Дата экзамена": datetime(2023, 12, 22), "Преподаватель": "Петрова"}},
    3: {"Математика": {"Дата экзамена": datetime(2023, 12, 18), "Преподаватель": "Иванова"},
        "Физика": {"Дата экзамена": datetime(2023, 12, 22), "Преподаватель": "Петрова"},
        "История": {"Дата экзамена": datetime(2024, 1, 8), "Преподаватель": "Сидорова"}},
    4: {"Физика": {"Дата экзамена": datetime(2023, 12, 20), "Преподаватель": "Иванова"},
        "Химия": {"Дата экзамена": datetime(2023, 12, 25), "Преподаватель": "Петрова"},
        "История": {"Дата экзамена": datetime(2024, 1, 12), "Преподаватель": "Сидорова"}},
     5: {"Литература": {"Дата экзамена": datetime(2023, 12, 15), "Преподаватель": "Иванова"},
        "Физика": {"Дата экзамена": datetime(2023, 12, 20), "Преподаватель": "Сидорова"},
        "История": {"Дата экзамена": datetime(2024, 1, 10), "Преподаватель": "Петрова"}},
    6: {"Математика": {"Дата экзамена": datetime(2023, 11, 25), "Преподаватель": "Козлова"},
        "Физика": {"Дата экзамена": datetime(2023, 12, 5), "Преподаватель": "Иванова"},
        "Химия": {"Дата экзамена": datetime(2023, 12, 22), "Преподаватель": "Смирнова"}},
    7: {"История": {"Дата экзамена": datetime(2023, 12, 18), "Преподаватель": "Иванова"},
        "Физика": {"Дата экзамена": datetime(2023, 12, 22), "Преподаватель": "Сидорова"},
        "Математика": {"Дата экзамена": datetime(2024, 1, 8), "Преподаватель": "Петрова"}},
    8: {"Физика": {"Дата экзамена": datetime(2023, 12, 20), "Преподаватель": "Иванова"},
        "Литература": {"Дата экзамена": datetime(2023, 12, 25), "Преподаватель": "Петрова"},
        "Химия": {"Дата экзамена": datetime(2024, 1, 12), "Преподаватель": "Сидорова"}}
}

# Вывод информации о студентах
students_df = pd.DataFrame(students)

print("Список студентов:")
print(students_df)

# Вывод зачетных книжек всех студентов
print("\nЗачетные книжки студентов:")
for student_num, grade_book in grades.items():
    print(f"\nСтудент {student_num}:")
    for subject, details in grade_book.items():
        print(f"Предмет: {subject}, Преподаватель: {details['Преподаватель']}, Дата экзамена: {details['Дата экзамена'].strftime('%Y-%m-%d')}")

# Выбор студента
student_number = int(input("\nВведите номер студента: "))

# Информация о выбранном студенте
student_info = students_df[students_df["Номер"] == student_number].squeeze()

print("\nИнформация о студенте:")
print(student_info)

# Вывод зачетной книжки выбранного студента с генерацией оценок
print("\nЗачетка студента:")
for subject, details in grades[student_number].items():
    grade = random.randint(3, 5)  # Генерация случайной оценки от 3 до 5
    print(f"Предмет: {subject}, Преподаватель: {details['Преподаватель']}, Дата экзамена: {details['Дата экзамена'].strftime('%Y-%m-%d')}, Оценка: {grade}")

"""
Вывод компилятора:
Список студентов:
   Номер   Фамилия        Имя Дата рождения
0      1   Асатрян      Давид    2000-05-10
1      2  Васильев   Григорий    2001-08-15
2      3    Рублев   Владимир    1999-03-20
3      4  Курченко       Иван    2002-11-25
4      5    Петров  Александр    2000-07-05
5      6   Сидоров      Павел    2001-04-18
6      7    Иванов     Сергей    2002-09-30
7      8    Козлов     Михаил    1998-12-12

Зачетные книжки студентов:

Студент 1:
Предмет: Математика, Преподаватель: Иванова, Дата экзамена: 2023-12-15
Предмет: Физика, Преподаватель: Петрова, Дата экзамена: 2023-12-20
Предмет: Химия, Преподаватель: Сидорова, Дата экзамена: 2024-01-10

Студент 2:
Предмет: История, Преподаватель: Козлова, Дата экзамена: 2023-11-25
Предмет: Литература, Преподаватель: Смирнова, Дата экзамена: 2023-12-05
Предмет: Физика, Преподаватель: Петрова, Дата экзамена: 2023-12-22

Студент 3:
Предмет: Математика, Преподаватель: Иванова, Дата экзамена: 2023-12-18
Предмет: Физика, Преподаватель: Петрова, Дата экзамена: 2023-12-22
Предмет: История, Преподаватель: Сидорова, Дата экзамена: 2024-01-08

Студент 4:
Предмет: Физика, Преподаватель: Иванова, Дата экзамена: 2023-12-20
Предмет: Химия, Преподаватель: Петрова, Дата экзамена: 2023-12-25
Предмет: История, Преподаватель: Сидорова, Дата экзамена: 2024-01-12

Студент 5:
Предмет: Литература, Преподаватель: Иванова, Дата экзамена: 2023-12-15
Предмет: Физика, Преподаватель: Сидорова, Дата экзамена: 2023-12-20
Предмет: История, Преподаватель: Петрова, Дата экзамена: 2024-01-10

Студент 6:
Предмет: Математика, Преподаватель: Козлова, Дата экзамена: 2023-11-25
Предмет: Физика, Преподаватель: Иванова, Дата экзамена: 2023-12-05
Предмет: Химия, Преподаватель: Смирнова, Дата экзамена: 2023-12-22

Студент 7:
Предмет: История, Преподаватель: Иванова, Дата экзамена: 2023-12-18
Предмет: Физика, Преподаватель: Сидорова, Дата экзамена: 2023-12-22
Предмет: Математика, Преподаватель: Петрова, Дата экзамена: 2024-01-08

Студент 8:
Предмет: Физика, Преподаватель: Иванова, Дата экзамена: 2023-12-20
Предмет: Литература, Преподаватель: Петрова, Дата экзамена: 2023-12-25
Предмет: Химия, Преподаватель: Сидорова, Дата экзамена: 2024-01-12

Введите номер студента: 2

Информация о студенте:
Номер                              2
Фамилия                     Васильев
Имя                         Григорий
Дата рождения    2001-08-15 00:00:00
Name: 1, dtype: object

Зачетка студента:
Предмет: История, Преподаватель: Козлова, Дата экзамена: 2023-11-25, Оценка: 3
Предмет: Литература, Преподаватель: Смирнова, Дата экзамена: 2023-12-05, Оценка: 5
Предмет: Физика, Преподаватель: Петрова, Дата экзамена: 2023-12-22, Оценка: 3
"""
