# -*- coding: utf-8 -*-
"""Варианта №3(15,9). Задание №15.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1N91oyApe23R2E95ECjeaV45fOJ6oGBVv

Вариант №3 (15,9).

Задание №15. Написать функцию генерации случайного email адреса формата <name>@<domen>.<local>.
"""

import random
import string

def generate_random_email():
    # Генерация случайного имени пользователя
    name_length = random.randint(5, 10)
    name = ''.join(random.choices(string.ascii_lowercase, k=name_length))

    # Генерация случайного домена
    domain_length = random.randint(5, 10)
    domain = ''.join(random.choices(string.ascii_lowercase, k=domain_length))

    # Генерация случайной локальной части
    local_length = random.randint(2, 4)
    local = ''.join(random.choices(string.ascii_lowercase, k=local_length))

    # Сборка email адреса
    email = f"{name}@{domain}.{local}"

    return email

# Пример использования функции
random_email = generate_random_email()
print(random_email)

"""
Вывод компилятора:

dbuwpu@pxibocmul.tnt
"""
